In [2]:
import pandas as pd
import numpy as np

data = { 
    'A':['A1', 'A2', 'A3', 'A4', 'A5'],  
    'B':['B1', 'B2', 'B3', 'B4', 'B5'],  
    'C':['C1', 'C2', 'C3', 'C4', 'C5'],  
    'D':['D1', 'D2', 'D3', 'D4', 'D5'],  
    'E':['E1', 'E2', 'E3', 'E4', 'E5'] } 

df4 = pd.DataFrame(data) 

df4

    A   B   C   D   E
0  A1  B1  C1  D1  E1
1  A2  B2  C2  D2  E2
2  A3  B3  C3  D3  E3
3  A4  B4  C4  D4  E4
4  A5  B5  C5  D5  E5

In [4]:
df4.drop(['A'], axis = 1)

    B   C   D   E
0  B1  C1  D1  E1
1  B2  C2  D2  E2
2  B3  C3  D3  E3
3  B4  C4  D4  E4
4  B5  C5  D5  E5

### Replace a value within table

In [5]:
import pandas as pd

df9 = pd.DataFrame([
['1', 'Fares', 32, 'NaN'],
['2', 'Elena', 23, 'NaN'],
['NaN', 'Steven', 40, True],
['4', 'Max', 24, 'NaN'],
['5', 'Mike', 20, False],
['NaN', 'John', 40, True]])

df9.columns = ['id', 'name', 'age', 'decision']

df9

    id    name  age decision
0    1   Fares   32      NaN
1    2   Elena   23      NaN
2  NaN  Steven   40     True
3    4     Max   24      NaN
4    5    Mike   20    False
5  NaN    John   40     True

In [6]:
df9.replace('NaN', ' ')

  id    name  age decision
0  1   Fares   32
1  2   Elena   23
2     Steven   40     True
3  4     Max   24
4  5    Mike   20    False
5       John   40     True

### Remove first value

In [7]:
df = ["month", "harry styles: (Worldwide)", "zayn malik: (Worldwide)", "niall Horan: (Worldwide)", "liam payne: (Worldwide)", "louis tomlinson: (Worldwide)", "one direction: (Worldwide)"]

df

['month',
 'harry styles: (Worldwide)',
 'zayn malik: (Worldwide)',
 'niall Horan: (Worldwide)',
 'liam payne: (Worldwide)',
 'louis tomlinson: (Worldwide)',
 'one direction: (Worldwide)']

In [8]:
df.pop(0)

'month'

In [9]:
df

['harry styles: (Worldwide)',
 'zayn malik: (Worldwide)',
 'niall Horan: (Worldwide)',
 'liam payne: (Worldwide)',
 'louis tomlinson: (Worldwide)',
 'one direction: (Worldwide)']